<?php

require('bfs.php');

function test($pic){
	$x = 0;
	$y = 0;
	
	echo "<link href=\"../css/style.css\" rel='stylesheet'>";
	
	$area = [];
	
	$i = 0;
	$j = 0;
	
	$count = 0;
	
	for (;$i<count($pic); $i++) {
		for ($j=0; $j<count($pic[$i]); $j++) {
			if ($pic[$i][$j] <= 0) {
				continue;
			}
			
			--$count;
			$pic[$i][$j] = $count;
			bfs($i, $j, $pic, function($pointV, $point) use (&$pic, &$count){
				if ($pointV == 0) {
					return false;
				}
				$pic[$point->x][$point->y] = $count;
				
			});
		}
	}
	
	$count = abs($count);
	
	$needtime = microtime(true) - $_SERVER['REQUEST_TIME_FLOAT'];
	$head = sprintf(
		'<div class="hd">统计地图岛屿数量，共<i>%d</i>个岛屿</div>',
		$count
		);
		
	$presentCls = ['water', 'land'];
	$html = '';
	
	foreach ($pic as $_x => $v) {
		$tmpl = '';
		foreach ($v as $_y => $vv) {
			if ($vv === 0) {
				$cls = 'water';
			} else {
				$cls = 'land';
			}
			 
			$tmpl .= sprintf('<em class="%2$s">%1$s</em>', $vv, $cls);
		}
		$html .= '<div class="it">'. $tmpl .'</div>';
	}
	
	$html = str_replace('x', $html, "<div class=\"maze\">${head}x</div>");
	printf('<div class="head">使用算法：%s</div>', '广度优先搜索');	
	
	echo $html;
	
}

$pic = [
	[0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,1,0,0,1,1,0,0,0,0,0,0,1,2,0],
	[0,0,0,0,0,0,0,0,0,1,1,1,0,0,1,0,0,2,1,0],
	[0,0,0,0,0,0,0,1,0,0,1,0,0,1,1,0,0,5,0,0],
	[0,1,0,0,1,0,0,0,1,0,0,0,0,1,1,0,0,0,0,0],
	[0,0,0,0,0,0,1,0,0,1,0,1,0,1,1,0,0,0,0,0],
	[0,0,0,0,0,0,2,0,1,0,1,1,1,1,1,0,0,0,0,0],
	[0,0,0,0,0,0,1,0,0,1,1,1,1,1,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,3,0],
	[0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,0,0,0,0,0],
	[0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0],
	[0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0],
	[0,0,0,0,0,6,0,0,0,0,0,0,1,1,1,1,0,0,0,0],
	[0,0,0,0,1,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,7,8,1,0,0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
];

test($pic, 8, 10);